huskyroboticsteam/PSoC_Project_Template/PSoC Project Template.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "DBG_UART.h"
#include "DBG_UART_SPI_UART.h"
#include "DBG_UART_PINS.h"
#include "DBG_UART_SPI_UART_PVT.h"
#include "DBG_UART_PVT.h"
#include "DBG_UART_BOOT.h"
#include "CAN_RX.h"
#include "CAN_RX_aliases.h"
#include "CAN_TX.h"
#include "CAN_TX_aliases.h"
#include "CAN.h"
#include "DIP1.h"
#include "DIP1_aliases.h"
#include "DIP2.h"
#include "DIP2_aliases.h"
#include "DIP3.h"
#include "DIP3_aliases.h"
#include "DIP4.h"
#include "DIP4_aliases.h"
#include "LED_ERR.h"
#include "LED_ERR_aliases.h"
#include "LED_DBG_1.h"
#include "LED_DBG_1_aliases.h"
#include "LED_CAN.h"
#include "LED_CAN_aliases.h"
#include "Timer_Period_Reset.h"
#include "isr_Period_Reset.h"
#include "Button_1.h"
#include "Button_1_aliases.h"
#include "isr_Button_1.h"
#include "DBG_UART_SCBCLK.h"
#include "DBG_UART_tx.h"
#include "DBG_UART_tx_aliases.h"
#include "DBG_UART_rx.h"
#include "DBG_UART_rx_aliases.h"
#include "CAN_isr.h"
#include "CAN_HFCLK.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

